| [[[#Top][Top]]]   | [Contents]   | [Index]   | [[[#SEC_About][?]]]   |

*** Evaluating code blocks

Use C-c C-c to evaluate the current code block and insert its results in
the Org-mode buffer. By default, evaluation is only turned on for
=emacs-lisp= code blocks, however support exists for evaluating blocks
in many languages. For a complete list of supported languages see the
manual. The following shows a code block and its results.

#+BEGIN_EXAMPLE
    #+begin_src emacs-lisp
      (+ 1 2 3 4)
    #+end_src

    #+results:
    : 10
#+END_EXAMPLE

